{
"About": {
  "Name": "Jazmin Chavez",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText":"Hello, I am a third-year Computer Science student with a minor in Communications at Seattle Pacific University. My interests extend to utilizing technology in addressing critical societal issues. I am particularly passionate about leveraging technology for anti-trafficking initiatives and forensic science applications. Currently, I am actively seeking an internship related to cybersecurity. I am excited about the potential to contribute meaningful projects and make a positive impact. If you have insights, job opportunities, or wish to connect and discuss how we can have influence through technology, please feel free to contact me."
},
"Contact": {
  "EMail": "chavezj3@spu.edu",
  "Phone": "(425) 876-6919",
  "Portfolio": "https://github.com/Ahava-j/Ahava-j.github.io/blob/main/Content/profile.json",
  "LinkedIn": "https://www.linkedin.com/in/jazmin-chavez-peraza",
  "GitHub": "https://github.com/Ahava-j"
},
"Experience": {
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2025",
  "EducationText": "As a Computer Science major with a minor in Communications, I bring a unique blend of technical expertise and interpersonal skills to the table. My Communications studies have taught me how to foster collaboration and create an inclusive environment where everyone feels heard. I am especially passionate about building spaces where quieter team members feel comfortable sharing their ideas, ensuring that every voice contributes to innovative solutions. This balance of technical knowledge and strong team dynamics enables me to approach challenges with creativity and empathy.",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Grader for Data Structures",
  "EmploymentText": "As a Teaching Assistant for Data Structures 1, I evaluated and graded student assignments and projects, with a primary focus on C++ programming, ensuring that all work adhered to the provided rubric. I provided detailed and constructive feedback to students, helping them deepen their understanding of the material and improve their coding skills. Additionally, I collaborated closely with the course instructor to maintain consistency in grading and uphold academic standards, demonstrating strong attention to detail and effective communication throughout the process.",
  "Skills": ["C++", "Python", "JavaScript", " CSS"," HTML"],
  "SkillsText": "I possess a strong technical foundation with proficiency in C++, complemented by foundational knowledge in Python, R, JavaScript, HTML, CSS, Go, and Prolog. My experience includes working with a variety of tools and technologies such as JetBrains CLion, Visual Studio Code, RStudio, Google Colab, Jupyter, GitHub, Docker, and Valgrind. Beyond technical skills, I am highly goal-oriented, organized, and charismatic, with strong communication and interpersonal abilities. My empathetic leadership style has enabled me to foster inclusive and high-performing team environments. ",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "System Proposal & System Specification - Individual Project",
    "Desc": "This is a comprehensive document that outlines SilentSignal's objectives, requirements, functionalities, and design. It also includes a structured collection of information that embodies the requirements of SilentSignal, a mobile application. As part of a systems design project, the document details the architecture, data flow, and technical specifications necessary for the development and deployment of SilentSignal. It incorporates user stories, wireframes, and a thorough analysis of both functional and non-functional requirements to ensure the application meets user needs while maintaining scalability and efficiency. Completing this project enhanced my skills in systems analysis, technical documentation, and user-centric design while strengthening my ability to work collaboratively on complex technical challenges and improve critical thinking and problem-solving competencies.",
    "GitHubRepo": "https://github.com/Ahava-j/Task-manager-test.git",
    "MainImage": "P1Main.png",
   "DetailImages": []
  },
  "Project2": {
    "Title": "Task Manager - Individual Project",
    "Desc": "This is a do to list task manager.",
    "GitHubRepo": "https://github.com/Ahava-j/Task-Manager",
    "MainImage": "ToDoLIST.png",
     "DetailImages": []
  },
  "Project3": {
    "Title": "C++ Certification  - Individual Project",
    "Desc": "This certification validates my ability to complete coding tasks focused on the foundational elements of C++, including the use of the standard library, preprocessor directives, and object-oriented programming principles. It demonstrates not only my proficiency in core C++ concepts but also my readiness to tackle professional programming challenges with confidence and precision. Earning this certification reflects my commitment to mastering the technical skills necessary for building efficient and scalable software solutions. It also highlights my ability to adapt to evolving technologies and apply fundamental principles across a variety of programming languages and paradigms, making me a competent and versatile programmer. While this certification equips me with a strong technical foundation, it also signifies my dedication to continual growth and learning in an ever-changing industry, ensuring that I remain capable of contributing effectively to both individual and team-based projects.",
    "MainImage": "Certifications.png",
   "DetailImages": []
  }
  
}
