{
"About": {
  "Name": "Jazmin Chavez",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText":"Hello, I am a third-year Computer Science student with a minor in Communications at Seattle Pacific University. My interests extend to utilizing technology in addressing critical societal issues. I am particularly passionate about leveraging technology for anti-trafficking initiatives and forensic science applications. Currently, I am actively seeking a summer 2024 internship related to anti-trafficking technology solutions. I am excited about the potential to contribute meaningful projects and make a positive impact. If you have insights, job opportunities, or wish to connect and discuss how we can have influence through technology, please feel free to contact me."
},
"Contact": {
  "EMail": "chavezj3@spu.edu",
  "Phone": "(425) 876-6919",
  "Portfolio": "https://github.com/Ahava-j/Ahava-j.github.io/blob/main/Content/profile.json",
  "LinkedIn": "linkedin.com/in/jazmin-chavez-peraza",
  "GitHub": "https://github.com/Ahava-j"
},
"Experience": {
  "ExperienceText": "Use this area to explain how you got to where you are and what you are currently doing now.<br><br>This is a good spot to talk yourself up.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2025",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Grader for Data Structures",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", "Python", "JavaScript", " CSS"," HTML"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "System Proposal & System Specification",
    "Desc": "This is a comprehensive document that outlines SilentSignal's objectives, requirements, functionalities, and design. It also includes a structured collection of information that embodies the requirements of SilentSignal, a mobile application.",
    "GitHubRepo": "https://github.com/Ahava-j/Task-manager-test.git",
    "MainImage": "P1Main.png",
   "DetailImages": []
  },
  "Project2": {
    "Title": "Task Manager",
    "Desc": "This is a do to list task manager.",
    "GitHubRepo": "https://github.com/Ahava-j/Task-Manager",
    "MainImage": "ToDoLIST.png",
     "DetailImages": []
  }
}
